[SEP]
[INT]
[OBJ]
[REL]
.
,
!
;
:
#
(
)
_
-
'
0
1
2
3
4
5
6
7
8
9
type
class
subclass
size
large
small
color
red
blue
green
not
dusty
not_dusty
undusty
stained
not_stained
unstained
cooked
not_cooked
uncooked
frozen
not_frozen
unfrozen
open
closed
toggled
not_toggled
toggled-on
toggled-off
sliced
unsliced
soaked
not_soaked
unsoaked
at
inside
ontop
human_holding
robot_holding
interactable
welcome
to
the
world
in
room
there
is
h
a
an
now
are
standing
on
see
it
your
turn
help
human
achieve
goal
currently
holding
nothing
recall
task
agent
has
taken
list
of
actions
towards
which
includes
stops
says
cannot
whether
any
valid
perform
[LOCATION]
[MOVABLE]
[RECEPTACLE]
[RECEPTACLE/LOCATION]
[TOGGLEABLE]
[COOKABLE]
[FREEZABLE]
[SOAKABLE]
[SLICEABLE]
[CLEANABLE]
[TOOL]
move
moves
pick
picks
up
from
put
puts
into
onto
take
give
opens
close
closes
off
heat
heats
cool
cools
soak
soaks
makes
questions
i
understand
say
clearly
mean
do
just
want
specific
like
one
top
position
don't
care
where
place
hand
bring
that
over
LOCATION
RECEPTACLE
FOOD
TOOL
THING
floor
countertop
sofa
bed
stove
table
shelf
toilet
cabinet
bathtub
microwave
oven
dishwasher
refrigerator
sink
pool
furniture
highchair
chair
seat
vessel
bottle
jar
kettle
caldron
tableware
bowl
mug
plate
dish
cup
utensil
saucepan
pan
casserole
bag
duffel_bag
sack
backpack
briefcase
bucket
tray
basket
box
package
ashcan
xmas_stocking
xmas_tree
fruit
apple
banana
melon
grape
lemon
orange
peach
strawberry
raspberry
date
olive
chestnut
vegetable
carrot
radish
tomato
broccoli
mushroom
onion
lettuce
pumpkin
drink
pop
beer
juice
water
milk
protein
beef
chicken
pork
fish
egg
flavorer
catsup
sauce
parsley
tea_bag
sugar
vegetable_oil
baked_food
cracker
bread
cookie
cake
snack
chip
hamburger
sandwich
candy
prepared_food
oatmeal
sushi
salad
soup
pasta
metal_tool
carving_knife
hammer
screwdriver
scraper
saw
electric_equipment
printer
scanner
facsimile
modem
electrical_device
calculator
headset
earphone
mouse
alarm
toiletry
toothbrush
perfume
makeup
writing_tool
highlighter
marker
pen
pencil
piece_of_cloth
dishtowel
hand_towel
rag
cleaning_tool
scrub_brush
broom
vacuum
cleansing
soap
shampoo
detergent
toothpaste
cutlery
fork
spoon
knife
illumination_tool
lamp
candle
decoration
necklace
bracelet
jewelery
bow
wreath
ribbon
paper_product
hardback
notebook
book
newspaper
painting
pad
document
footwear
gym_shoe
sandal
shoe
sock
headwear
hat
sunglass
clothing
shirt
sweater
underwear
apparel
building_materials
tile
plywood
plaything
cube
ball
and
or
forall
exists
x
y
phyobj
robot
please
can
you
me
?x
?y